{
  "projects": {
    "personal": [
      {
        "id": "personalProject1",
        "Link": "https://letmeask-ecru.vercel.app/",
        "Title": "Letmeask - Q&A Sessions for Content Creators",
        "Intro": "Letmeask is a web application designed to facilitate Q&A sessions for content creators. The platform allows creators to open exclusive rooms where their audience can ask questions in an organized and democratic manner. By providing a structured environment, Letmeask enhances the interaction between content creators and their public, fostering engagement and a sense of community.",
        "ImageIntro": "/images/projects/letmeaskHomePage.png",
        "ImageConclusion": "/images/projects/letmeaskRoomView.png",
        "KeyFeatures": [
          "Exclusive Q&A Rooms: Content creators can open dedicated Q&A rooms for their audience. These rooms provide a focused space for discussion and enable creators to maintain control over the session.",
          "Question Management: Once questions are posted in a room, the creator has the authority to answer, check, like, or delete them. The comment icon allows the creator to highlight the question being answered, ensuring clarity for both the creator and the audience. If a question is deemed inappropriate or irrelevant, the creator can delete it to maintain the quality of the session.",
          "Authentication and Access: Users can log in to create a room and share its code with their audience. Alternatively, users can log in and access a specific room by entering its unique code. Participation in the discussion and the ability to like questions requires user login, while anonymous users can still follow the conversation."
        ],
        "Technologies": [
          "Firebase: Leveraging Firebase for authentication and database functionalities, allowing seamless user management and real-time updates.",
          "React: Built using the React framework for creating dynamic and responsive user interfaces.",
          "React Hooks: Utilized React Hooks, specifically createContext and useEffect, to manage state and lifecycle functionalities efficiently.",
          "TypeScript: Employed TypeScript for type safety and enhanced development productivity.",
          "Sass: Utilized Sass for styling, enabling a modular and scalable approach to UI design."
        ],
        "DevelopmentJourney": [
          "Letmeask was created as a personal project during participation in the Next Level Week event offered by RocketSet, an esteemed Brazilian education platform focused on teaching developers.",
          "The project was developed with the intention of providing content creators with a simple yet powerful tool to engage with their audience and conduct Q&A sessions in an organized and democratic manner.",
          "The insights gained from the Next Level Week event and the experience of building Letmeask helped in enhancing development skills and fostering a deeper understanding of web application architecture."
        ],
        "Conclusion": [
          "Letmeask offers content creators a platform to facilitate Q&A sessions with their audience in an organized and democratic way.",
          "With its exclusive Q&A rooms, question management features, and user-friendly interface, Letmeask empowers creators to interact effectively with their public, fostering engagement and community building.",
          "Built using Firebase, React, TypeScript, and Sass, Letmeask embodies the spirit of continuous learning and improvement, exemplifying the value of educational events like Next Level Week."
        ]
    
      },
      {
        "id": "personalProject2",
        "Link": "https://letmeask-ecru.vercel.app/",
        "Title": "Letmeask - Organizing Q&A Sessions for Content Creators",
        "Intro": "Letmeask is a web application designed to facilitate Q&A sessions for content creators. The platform allows creators to open exclusive rooms where their audience can ask questions in an organized and democratic manner. By providing a structured environment, Letmeask enhances the interaction between content creators and their public, fostering engagement and a sense of community.",
        "ImageIntro": "/images/projects/letmeaskHomePage.png",
        "ImageConclusion": "/images/projects/letmeaskRoomView.png",
        "KeyFeatures": [
          "Exclusive Q&A Rooms: Content creators can open dedicated Q&A rooms for their audience. These rooms provide a focused space for discussion and enable creators to maintain control over the session.",
          "Question Management: Once questions are posted in a room, the creator has the authority to answer, check, like, or delete them. The comment icon allows the creator to highlight the question being answered, ensuring clarity for both the creator and the audience. If a question is deemed inappropriate or irrelevant, the creator can delete it to maintain the quality of the session.",
          "Authentication and Access: Users can log in to create a room and share its code with their audience. Alternatively, users can log in and access a specific room by entering its unique code. Participation in the discussion and the ability to like questions requires user login, while anonymous users can still follow the conversation."
        ],
        "Technologies": [
          "Firebase: Leveraging Firebase for authentication and database functionalities, allowing seamless user management and real-time updates.",
          "React: Built using the React framework for creating dynamic and responsive user interfaces.",
          "React Hooks: Utilized React Hooks, specifically createContext and useEffect, to manage state and lifecycle functionalities efficiently.",
          "TypeScript: Employed TypeScript for type safety and enhanced development productivity.",
          "Sass: Utilized Sass for styling, enabling a modular and scalable approach to UI design."
        ],
        "DevelopmentJourney": [
          "Letmeask was created as a personal project during participation in the Next Level Week event offered by RocketSet, an esteemed Brazilian education platform focused on teaching developers.",
          "The project was developed with the intention of providing content creators with a simple yet powerful tool to engage with their audience and conduct Q&A sessions in an organized and democratic manner.",
          "The insights gained from the Next Level Week event and the experience of building Letmeask helped in enhancing development skills and fostering a deeper understanding of web application architecture."
        ],
        "Conclusion": [
          "Letmeask offers content creators a platform to facilitate Q&A sessions with their audience in an organized and democratic way.",
          "With its exclusive Q&A rooms, question management features, and user-friendly interface, Letmeask empowers creators to interact effectively with their public, fostering engagement and community building.",
          "Built using Firebase, React, TypeScript, and Sass, Letmeask embodies the spirit of continuous learning and improvement, exemplifying the value of educational events like Next Level Week."
        ]
    
      }
    ],
    "work": [
      {
        "id": "project1",
        "ImageIntro":"/images/projects/marketPlace.jpg",
        "Title": "Marketplace to Sell NFT Collections",
        "Role": "Frontend Developer",
        "Year": "2022",
        "Intro": "This is a marketplace application designed to sell NFT collections. This Whitelabel application offers a customizable solution that supports different themes, allowing clients to tailor the platform to match their brand identity.",
        "KeyFeaturesAndFunctionality": [
            "Exclusive NFT Collections: Users gain access to exclusive NFT collections by subscribing to specific collections, offering a unique and curated experience.",
            "Traditional Payment Options: Users can purchase NFTs using regular payment methods like credit cards, eliminating the need for cryptocurrency in their wallets.",
            "Crypto Wallet Integration: While no cryptocurrency is required for payment, users must have a crypto wallet to securely hold the purchased NFTs and sell them on any other platform.",
            "Individual and Box Sales: Users have the flexibility to buy individual NFT units or a box of NFTs, enabling diverse purchasing options.",
            "Dynamic Content Unveiling: The box’s content remains a mystery until it is opened. Once revealed, the NFTs are minted and seamlessly sent to the owner's wallet."
        ],
        "FrontendDevelopmentAndDesign": "Collaborating closely with our talented design team, we transformed creative concepts into a captivating user interface.\n\nUsing Figma, a powerful design tool, we ensured a seamless integration between design and development, resulting in a visually stunning and user-friendly marketplace experience.\n\nFor the frontend development, we utilized a powerful stack including React, TypeScript, Styled Components, and Redux. These modern technologies ensured a smooth and visually appealing user interface. Leveraging environment variables and name extensions, we seamlessly rendered specific themes and content, offering a cohesive and customized experience for each client.\n\nTo streamline development and enhance maintainability, we employed Storybook, a tool that efficiently documented and provided valuable context for components. Following the atomic design approach, we divided the user interface into reusable components, promoting scalability and ease of maintenance.\n\nEnsuring code quality and reliability, every component underwent comprehensive unit testing. We employed snapshots for smaller components, such as atoms, allowing efficient and reliable testing.",
        "BackendTechnologiesAndIntegration": "The backend of the marketplace application was built using Node.js and C#, providing a robust and scalable foundation. We integrated Vendure, a flexible and customizable e-commerce solution, and Stripe for secure payment management and processing.\n\nTo leverage the power of blockchain technology, we employed Solidity to build smart contracts, facilitating the creation and management of NFTs within the marketplace.",
        "ProjectManagementAndCollaboration": "Throughout the project, we maintained a flexible project management methodology, employing Scrum as the underlying structure. Jira served as our chosen project management solution, enabling effective monitoring of tasks, fostering team collaboration, and facilitating progress tracking. Furthermore, GitHub functioned as the version control system, guaranteeing smooth code collaboration and systematic versioning.\n\nIn partnership with our design team, we harmonized with the stakeholders to integrate their vision into the user interface of the application. Figma, a potent design tool, streamlined cooperation and secured a unified and aesthetically gratifying design execution.",
        "ImageConclusion":"/images/projects/nft.jpg",
        "Conclusion": "In summary, the Marketplace to Sell NFT Collections is a dynamic and customizable platform enabling exclusive NFT collections to be sold and distributed. With close collaboration between the frontend development and design teams, we successfully transformed creative concepts into a visually stunning user interface. I am happy that I have contributed as a frontend developer to this innovative project, employing robust testing, atomic design principles, and a meticulous development workflow.\n\n㎰This application is not online and images are only for ilustration."
      },
      {
        "id": "project2",
        "ImageIntro":"/images/projects/fearShadow.svg",
        "Title": "Ceta: Facing Fears and Worries",
        "Role": "Frontend Developer",
        "Year": "2023",
        "Intro": "A MVP application designed to help children overcome anxiety. This application provides a supportive platform where parents act as tutors, guiding their kids through 10 modules and engaging in activities to address fears and worries.",
        "KeyFeaturesAndFunctionality": [
            "Parental Guidance: Parents play a crucial role as tutors, providing guidance and support to their children throughout the journey. They actively participate in the ten modules and accompanying activities, fostering a nurturing and interactive learning environment.",
            "Goal Setting and Progress Tracking: Children describe their fears and worries, and with their parents, they set achievable goals and engage in activities to overcome them. Progress is tracked and celebrated, motivating children to persevere and grow.",
            "Reward System: Completing activities and modules earns users points, which can be redeemed for predefined rewards. This gamification element adds excitement and incentivizes children to participate and complete tasks actively."
        ],
        "FrontendDevelopmentAndDesign": "The application’s frontend was built using Next.js, TypeScript, and Tailwind CSS. These modern technologies ensured a robust, efficient, visually appealing user interface. Leveraging the power of Next.js, we created a seamless and optimized user experience.\n\nEvery component was thoroughly tested using Jest, ensuring high code quality and reliability. The testing process covered all frontend aspects, guaranteeing a stable and consistent application.",
        "BackendTechnologiesAndIntegration": "For deployment, we utilized AWS and specifically leveraged Amplify for seamless integration and scalability. This allowed for a smooth deployment process, ensuring the application was readily available to users.\n\nThe application’s backend was structured using GraphQL, enabling efficient data management and structuring of the database. This facilitated seamless communication between the frontend and backend components, optimizing performance and user experience.\n\nSanity was employed as a content management system to efficiently handle and update module content, providing flexibility and ease of management.",
        "ProjectManagementAndCollaboration": "We adhered to an agile project management approach throughout the project, utilizing Scrum as the framework. Jira was the project management tool, facilitating efficient task tracking, team collaboration, and progress monitoring. Additionally, Bitbucket was the version control system, ensuring seamless code collaboration and versioning.\n\nCollaborating with the client's internal design team, we incorporated their design vision into the application's user interface. Figma, a powerful design tool, streamlined collaboration and ensured a cohesive and visually pleasing design implementation.",
        "ImageConclusion":"/images/projects/overcomeFear.jpg",
        "Conclusion": "Ceta MVP application is a powerful platform designed to empower children to overcome anxiety. With parents acting as tutors, children engage in modules, activities, and goal-setting exercises to address their fears and worries.\n\nI am proud to have contributed to this impactful project, providing children with a supportive tool to navigate and conquer their anxiety.\n\n㎰This product is not online and the images are only for ilustration."
      }
    ]
  }
}